micropython/micropython/ports/stm32/mboot/main.c
    return 0;
}

/******************************************************************************/
// Writable address space interface

static int do_mass_erase(void) {
    // TODO spiflash erase ?
    return mboot_flash_mass_erase();
}

#if defined(MBOOT_SPIFLASH_ADDR) || defined(MBOOT_SPIFLASH2_ADDR)
static int spiflash_page_erase(mp_spiflash_t *spif, uint32_t addr, uint32_t n_blocks) {
    for (int i = 0; i < n_blocks; ++i) {
        int ret = mp_spiflash_erase_block(spif, addr);
        if (ret != 0) {
            return ret;
        }
        addr += MP_SPIFLASH_ERASE_BLOCK_SIZE;
    }
    return 0;
}
#endif

int do_page_erase(uint32_t addr, uint32_t *next_addr) {
    int ret = -1;
    led0_state(LED0_STATE_ON);

    #if defined(MBOOT_SPIFLASH_ADDR)
    if (MBOOT_SPIFLASH_ADDR <= addr && addr < MBOOT_SPIFLASH_ADDR + MBOOT_SPIFLASH_BYTE_SIZE) {
        *next_addr = addr + MBOOT_SPIFLASH_ERASE_BLOCKS_PER_PAGE * MP_SPIFLASH_ERASE_BLOCK_SIZE;
        ret = spiflash_page_erase(MBOOT_SPIFLASH_SPIFLASH,
                addr - MBOOT_SPIFLASH_ADDR, MBOOT_SPIFLASH_ERASE_BLOCKS_PER_PAGE);
    } else
    #endif
    #if defined(MBOOT_SPIFLASH2_ADDR)
    if (MBOOT_SPIFLASH2_ADDR <= addr && addr < MBOOT_SPIFLASH2_ADDR + MBOOT_SPIFLASH2_BYTE_SIZE) {
        *next_addr = addr + MBOOT_SPIFLASH2_ERASE_BLOCKS_PER_PAGE * MP_SPIFLASH_ERASE_BLOCK_SIZE;
        ret = spiflash_page_erase(MBOOT_SPIFLASH2_SPIFLASH,
                addr - MBOOT_SPIFLASH2_ADDR, MBOOT_SPIFLASH2_ERASE_BLOCKS_PER_PAGE);
    } else
    #endif
    {
        ret = mboot_flash_page_erase(addr, next_addr);
    }

    led0_state((ret == 0) ? LED0_STATE_SLOW_FLASH : LED0_STATE_SLOW_INVERTED_FLASH);
    return ret;
}

void do_read(uint32_t addr, int len, uint8_t *buf) {
    #if MBOOT_ENCRYPTED
    // read disabled on encrypted mboot
    dfu_context.status = DFU_STATUS_ERROR_FILE;
    dfu_context.error = MBOOT_ERROR_STR_INVALID_READ_IDX;
    led0_state(LED0_STATE_SLOW_INVERTED_FLASH);
    return;
    #endif

    led0_state(LED0_STATE_FAST_FLASH);
    #if defined(MBOOT_SPIFLASH_ADDR)
    if (MBOOT_SPIFLASH_ADDR <= addr && addr < MBOOT_SPIFLASH_ADDR + MBOOT_SPIFLASH_BYTE_SIZE) {
        mp_spiflash_read(MBOOT_SPIFLASH_SPIFLASH, addr - MBOOT_SPIFLASH_ADDR, len, buf);
    } else
    #endif
    #if defined(MBOOT_SPIFLASH2_ADDR)
    if (MBOOT_SPIFLASH2_ADDR <= addr && addr < MBOOT_SPIFLASH2_ADDR + MBOOT_SPIFLASH2_BYTE_SIZE) {
        mp_spiflash_read(MBOOT_SPIFLASH2_SPIFLASH, addr - MBOOT_SPIFLASH2_ADDR, len, buf);
    } else
    #endif
    {
        // Other addresses, just read directly from memory
        memcpy(buf, (void*)addr, len);
    }
    led0_state(LED0_STATE_SLOW_FLASH);
}

#if MBOOT_ENCRYPTED
#define DICT_SIZE (1 << 15)

static int gz_stream_read(TINF_DATA *tinf, size_t len, uint8_t *buf) {
    tinf->dest = buf;
    tinf->dest_limit = buf + len;
    int st = uzlib_uncompress_chksum(tinf);
    if (st < 0) {
        return st;
    }
    return tinf->dest - buf;
}

bool encryption_enabled() {
    for (uint8_t i = 0; i < sizeof(public_key_t); i++) {
        if (((char *)(*mboot_public_key))[i] != 0xFF) {
            return true;
        }
    }
    return false;
}
#endif  // MBOOT_ENCRYPTED

int hw_write(uint32_t addr, uint8_t *src8, size_t len) {
    int ret = -1;
    #if MBOOT_ENCRYPTED
    // In encrypted mode the erase is automatically managed.
    // Note: this scheme requires blocks be written in sequence, which is the norm anyway.
    if (addr >= APPLICATION_ADDR) {
        if (next_page_erase == -1) {
            next_page_erase = addr;
        }
        while ((addr + len) > next_page_erase) {
            uint32_t next_addr;
            ret = do_page_erase(next_page_erase, &next_addr);
            if (ret != 0) {
                return -1;
            }
            next_page_erase = next_addr;
        }
    }
    #endif  // MBOOT_ENCRYPTED

    led0_state(LED0_STATE_FAST_FLASH);
    #if defined(MBOOT_SPIFLASH_ADDR)
    if (MBOOT_SPIFLASH_ADDR <= addr && addr < MBOOT_SPIFLASH_ADDR + MBOOT_SPIFLASH_BYTE_SIZE) {
        ret = mp_spiflash_write(MBOOT_SPIFLASH_SPIFLASH, addr - MBOOT_SPIFLASH_ADDR, len, src8);
    } else
    #endif
    #if defined(MBOOT_SPIFLASH2_ADDR)
    if (MBOOT_SPIFLASH2_ADDR <= addr && addr < MBOOT_SPIFLASH2_ADDR + MBOOT_SPIFLASH2_BYTE_SIZE) {
        ret = mp_spiflash_write(MBOOT_SPIFLASH2_SPIFLASH, addr - MBOOT_SPIFLASH2_ADDR, len, src8);
    } else
    #endif
    if (flash_is_valid_addr(addr)) {
        ret = mboot_flash_write(addr, src8, len);
    } else {
        dfu_context.status = DFU_STATUS_ERROR_ADDRESS;
        dfu_context.error = MBOOT_ERROR_STR_INVALID_ADDRESS_IDX;
    }

    led0_state((ret == 0) ? LED0_STATE_SLOW_FLASH : LED0_STATE_SLOW_INVERTED_FLASH);
    return ret;
}

int do_write(uint32_t addr, uint8_t *src8, size_t len) {
    #if !MBOOT_ENCRYPTED
    return hw_write(addr, src8, len);

    #else
    bool gzip = false;
    uint8_t decrypted[sizeof(fw_enc_buff.data)];

    if (!encryption_enabled()) {
        // The un-encrypted application footer must be programmed first
        // to store the encryption public key
        MP_STATIC_ASSERT(sizeof(fw_footer_v1_t) == 0xD0); // should match FOOTER_LENGTH in tools/mboot_signed_dfu.py
        if (addr == (uint32_t)__fw_footer) {
            // Check the footer is valid then write the public key into mboot
            fw_footer_v1_t *ftr = (fw_footer_v1_t *)src8;
            if (ftr->footer_vers == FOOTER_VERSION && flash_is_valid_addr(ftr->sections[0].address)) {
                int ret = hw_write((uint32_t)mboot_public_key, ftr->public_key, sizeof(public_key_t));
                return ret;
            }
            dfu_context.status = DFU_STATUS_ERROR_VERIFY;
            dfu_context.error = MBOOT_ERROR_STR_UNENCRYPTED_IDX;
            return -1;
        } else {
            // Don't support flashing in un-encrypted mode
            dfu_context.status = DFU_STATUS_ERROR_VENDOR;
            dfu_context.error = MBOOT_ERROR_STR_UNENCRYPTED_IDX;
            return -1;
        }

    } else {  // encryption_enabled()
        if (addr == (uint32_t)APPLICATION_ADDR) {
            // Base address of main firmware, reset any previous state
            fw_enc_buff_addr = fw_enc_buff_next = 0;
            next_page_erase = addr;
        }

        int32_t buff_addr = fw_enc_buff_addr;
        int32_t buff_next = fw_enc_buff_next;

        if ((fw_enc_buff_addr == 0) || (fw_enc_buff_addr == addr)) {
            // Start of chunk been sent
            buff_addr = addr;
            fw_enc_buff_addr = addr;
            memcpy(&fw_enc_buff, src8, len);
            fw_enc_buff_next = addr + len;

        } else

        if (((addr - buff_addr) + len) > sizeof(fw_enc_buff)) {
            // buffer's been filled, process existing buffer
            // Copy new data into buffer afterwards
            fw_enc_buff_addr = 0;

        } else if (addr < buff_addr) {
            // new addr chunk outside buffer, process existing buffer
            // Copy new data into buffer afterwards
            fw_enc_buff_addr = 0;

        } else if (addr == buff_next) {
            // Next normal chunk into buffer
            memcpy(&fw_enc_buff.data[addr - buff_addr - sizeof(chunk_header_v1_t)], src8, len);
            fw_enc_buff_next = addr + len;

        } else {
            // New addr range, process existing buffer
            // Copy new data into buffer afterwards
            fw_enc_buff_addr = 0;
        }

        size_t fw_enc_buff_len = fw_enc_buff_next - buff_addr;

        if (fw_enc_buff.header.header_vers != 1) {
            dfu_context.status = DFU_STATUS_ERROR_FILE;
            dfu_context.error = MBOOT_ERROR_STR_INVALID_SIG_IDX;
            return -1;
        }
        if (fw_enc_buff.header.address != buff_addr) {
            // Chunk address doesn't agree with dfu address, abort
            dfu_context.status = DFU_STATUS_ERROR_ADDRESS;
            dfu_context.error = MBOOT_ERROR_STR_INVALID_SIG_IDX;
            return -1;
        }

