micropython/micropython/ports/stm32/mboot/main.c
        if (fw_enc_buff.header.length > fw_enc_buff_len) {
            // Don't have entire chunk yet
            return 0;
        }

        if (hydro_sign_verify(fw_enc_buff.header.signature, fw_enc_buff.data, fw_enc_buff.header.length, ENC_CONTEXT, *mboot_public_key) != 0) {
            // Signature failed
            if (fw_enc_buff_addr == 0) {
                // We should have a full chunk here, if it fails we abort entire process
                dfu_context.status = DFU_STATUS_ERROR_VERIFY;
                dfu_context.error = MBOOT_ERROR_STR_INVALID_SIG_IDX;
                return -1;
            } else {
                return 0;
            }
        } else {
            // Signature passes, we have valid message to flash
            if (hydro_secretbox_decrypt(decrypted, fw_enc_buff.data, fw_enc_buff.header.length, 0, ENC_CONTEXT, *mboot_public_key) != 0) {
                dfu_context.status = DFU_STATUS_ERROR_VERIFY;
                dfu_context.error = MBOOT_ERROR_STR_INVALID_SIG_IDX;
                return -1;
            }

            if (fw_enc_buff.header.format == GZIP) {
                gzip = true;
            }

            // Use the decrypted message contents going formward
            len = fw_enc_buff.header.length - hydro_secretbox_HEADERBYTES;
            src8 = decrypted;
            addr = buff_addr;
        }

        // We've just validated the previous buffer and a decrypted copy is about to be flashed
        // Reset the buffer and copy this new chunk into it.
        if (fw_enc_buff_addr == 0) {
            fw_enc_buff_addr = addr;
            memcpy(&fw_enc_buff.data[0], src8, len);
            fw_enc_buff_next = addr + len;
        }

        // If we get here it means we've got a verified and decrypted chunk ready to write.
        // Reset buffer marker for next chunk
        fw_enc_buff_addr = 0;
    }

    uint8_t ret = 0;
    if (gzip) {
        TINF_DATA tinf = {0};
        uint8_t buf[MBOOT_ENC_GZIP_BUFFER_SIZE];
        uint8_t dict[DICT_SIZE];

        tinf.source = src8;
        tinf.source_limit = src8 + len;
        tinf.dest = buf;
        tinf.dest_limit = buf + sizeof(buf);

        uzlib_uncompress_init(&tinf, dict, DICT_SIZE);

        int read = -1;
        while (tinf.source < tinf.source_limit) {
            read = gz_stream_read(&tinf, sizeof(buf), buf);
            if (read == 0) {
                break;  // finished decompressing
            } else if (read < 0) {
                return -1;  // error reading
            }

            if (addr == APPLICATION_ADDR) {
                // Mark the 2 lower bits to indicate invalid app firmware
                // These will be written to 0 later after hash checks out
                buf[0] |= APP_VALIDITY_BITS;
            }
            ret |= hw_write(addr, buf, read);
            addr += read;
        }

    } else {  // ! gzip
        if (addr == APPLICATION_ADDR) {
            // Mark the 2 lower bits to indicate invalid app firmware
            // These will be written to 0 later after hash checks out
            src8[0] |= APP_VALIDITY_BITS;
        }
        ret = hw_write(addr, src8, len);
    }

    if (addr >= (uint32_t)__fw_footer && !encryption_enabled()) {
        // If this is the first time it's flashed an encryption key, snapshot in mboot
        ret = hw_write((uint32_t)mboot_public_key, __fw_footer->public_key, sizeof(public_key_t));
    }
    return ret;
    #endif  // MBOOT_ENCRYPTED
}

#if MBOOT_ENCRYPTED
void check_hash_reset() {
    if (!encryption_enabled()) {
        do_reset();
    }
    // Check hash
    led0_state(LED0_STATE_FAST_FLASH);
    bool passed = true;

    if (__fw_footer->footer_vers != FOOTER_VERSION) {
        passed = false;
    } else {
        for (uint8_t i = 0; i < MBOOT_FW_SECTIONS; i++) {
            volatile fw_footer_section_v1_t section = __fw_footer->sections[i];
            if (section.address != -1) {
                uint8_t hash[sizeof(section.sha256)] = {0};
                uint32_t address = section.address;
                uint32_t length = section.length;
                if (i == 0) {
                    // First byte skipped from hash for APP_VALIDITY_BITS
                    address += 1;
                    length -= 1;
                }
                sha256_hash(hash, (const uint8_t *)(address), length);
                if (memcmp(hash, (uint8_t *)section.sha256, sizeof(hash)) != 0) {
                    passed = false;
                }
            }
        }
    }
    if (passed) {
        uint32_t buf = *(volatile uint32_t *)APPLICATION_ADDR;

        if ((buf & APP_VALIDITY_BITS) == APP_VALIDITY_BITS) {
            buf &= ~APP_VALIDITY_BITS;
            hw_write(APPLICATION_ADDR, (void *)&buf, 4);
        }
    }
    do_reset();
}
#endif  // MBOOT_ENCRYPTED
/******************************************************************************/
// I2C slave interface

#if defined(MBOOT_I2C_SCL)

#define PASTE2(a, b) a ## b
#define PASTE3(a, b, c) a ## b ## c
#define EVAL_PASTE2(a, b) PASTE2(a, b)
#define EVAL_PASTE3(a, b, c) PASTE3(a, b, c)

#define MBOOT_I2Cx EVAL_PASTE2(I2C, MBOOT_I2C_PERIPH_ID)
#define I2Cx_EV_IRQn EVAL_PASTE3(I2C, MBOOT_I2C_PERIPH_ID, _EV_IRQn)
#define I2Cx_EV_IRQHandler EVAL_PASTE3(I2C, MBOOT_I2C_PERIPH_ID, _EV_IRQHandler)

#define I2C_CMD_BUF_LEN (129)

enum {
    I2C_CMD_ECHO = 1,
    I2C_CMD_GETID,      // () -> u8*12 unique id, ASCIIZ mcu name, ASCIIZ board name
    I2C_CMD_GETCAPS,    // not implemented
    I2C_CMD_RESET,      // () -> ()
    I2C_CMD_CONFIG,     // not implemented
    I2C_CMD_GETLAYOUT,  // () -> ASCII string
    I2C_CMD_MASSERASE,  // () -> ()
    I2C_CMD_PAGEERASE,  // le32 -> ()
    I2C_CMD_SETRDADDR,  // le32 -> ()
    I2C_CMD_SETWRADDR,  // le32 -> ()
    I2C_CMD_READ,       // u8 -> bytes
    I2C_CMD_WRITE,      // bytes -> ()
    I2C_CMD_COPY,       // not implemented
    I2C_CMD_CALCHASH,   // le32 -> u8*32
    I2C_CMD_MARKVALID,  // () -> ()
};

typedef struct _i2c_obj_t {
    volatile bool cmd_send_arg;
    volatile bool cmd_arg_sent;
    volatile int cmd_arg;
    volatile uint32_t cmd_rdaddr;
    volatile uint32_t cmd_wraddr;
    volatile uint16_t cmd_buf_pos;
    uint8_t cmd_buf[I2C_CMD_BUF_LEN];
} i2c_obj_t;

static i2c_obj_t i2c_obj;

void i2c_init(int addr) {
    i2c_obj.cmd_send_arg = false;

    mp_hal_pin_config(MBOOT_I2C_SCL, MP_HAL_PIN_MODE_ALT_OPEN_DRAIN, MP_HAL_PIN_PULL_NONE, MBOOT_I2C_ALTFUNC);
    mp_hal_pin_config(MBOOT_I2C_SDA, MP_HAL_PIN_MODE_ALT_OPEN_DRAIN, MP_HAL_PIN_PULL_NONE, MBOOT_I2C_ALTFUNC);

    i2c_slave_init(MBOOT_I2Cx, I2Cx_EV_IRQn, IRQ_PRI_I2C, addr);
}

